In [5]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\itexp\anaconda3\lib\site-packages (2.2.9)

In [11]:
import mysql.connector

database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "class415pm"
)
db = database.cursor()

In [12]:
sql = "SELECT * FROM student"
db.execute(sql)
result = db.fetchall()
result

[(1, 'Ram', 20, 30, 50, 30, 50, 412, 64.5, 'B'),
 (2, 'Sita', 50, 80, 75, 65, 35, 612, 74.0, 'A'),
 (3, 'Shyam', 78, 92, 64, 74, 83, 725, 84.2, 'A'),
 (4, 'Rohan', 95, 89, 81, 77, 62, 569, 67.2, 'C'),
 (5, 'Radha', 70, 89, 46, 65, 79, 780, 76.3, 'B'),
 (6, 'Sohani', 78, 98, 63, 42, 52, 456, 63.2, 'B')]

In [13]:
sql = "SELECT * FROM student WHERE grade='A'"
db.execute(sql)
result = db.fetchall()
result

[(2, 'Sita', 50, 80, 75, 65, 35, 612, 74.0, 'A'),
 (3, 'Shyam', 78, 92, 64, 74, 83, 725, 84.2, 'A')]

In [18]:
sql = '''INSERT INTO `student` (`sn`, `name`, `physics`, `chemistry`, `maths`, `english`, `nepali`, `total`, `per`, `grade`) 
VALUES ('9', 'Rita', '60', '98', '90', '23', '64', '769', '78.7', 'B')'''
db.execute(sql)
database.commit()

In [19]:
sql = "SELECT * FROM student"
db.execute(sql)
result = db.fetchall()
result

[(1, 'Ram', 20, 30, 50, 30, 50, 412, 64.5, 'B'),
 (2, 'Sita', 50, 80, 75, 65, 35, 612, 74.0, 'A'),
 (3, 'Shyam', 78, 92, 64, 74, 83, 725, 84.2, 'A'),
 (4, 'Rohan', 95, 89, 81, 77, 62, 569, 67.2, 'C'),
 (5, 'Radha', 70, 89, 46, 65, 79, 780, 76.3, 'B'),
 (6, 'Sohani', 78, 98, 63, 42, 52, 456, 63.2, 'B'),
 (7, 'Shya', 40, 78, 59, 63, 44, 569, 63.7, 'C'),
 (8, 'Rita', 60, 98, 90, 23, 64, 769, 78.7, 'B'),
 (9, 'Rita', 60, 98, 90, 23, 64, 769, 78.7, 'B')]